# PassesFilter Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExtensibleStorageFilter..::..PassesFilter Method
ExtensibleStorageFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PassesFilter(Element) | Applies the filter to a given element.  (Inherited from ElementFilter.) |
| PassesFilter(Document, ElementId) | Applies the filter to a given element.  (Inherited from ElementFilter.) |

# See Also
ExtensibleStorageFilter Class
ExtensibleStorageFilter Members
Autodesk.Revit.DB.ExtensibleStorage Namespace